Repository: am0c/modern_perl_book
Catalog: sections-ko/omegat/project_save.tmx
Source language: en_us
Languages: ko

source: One of Perl's most useful and least appreciated features is the C<perldoc> utility.
ko: 펄에서 가장 유연하면서도 그 가치가 잘 활용되지 않는 기능 중 하나는 C<perldoc> 도구입니다.

source: This program is part of every complete Perl 5 installationN<You may have to install an additional package on a free GNU/Linux distribution or another Unix-like system; on Debian and Ubuntu this is C<perl-doc>.>.
ko: 이 프로그램은 모든 펄 5 설치N<GNU/Linux 배포판이나 기타 유닉스 계열 시스템에서는 추가로 패키지를 설치해야 할 수도 있습니다; 데비안이나 우분투인 경우 C<perl-doc>입니다.>에 포함됩니다.

source: It displays the documentation of every Perl module installed on the system--whether a core module or one installed from the Comprehensive Perl Archive Network (CPAN)--as well as thousands of pages of Perl's copious core documentation.
ko: 시스템에 설치된 모든 펄 모듈에 대한 문서를 보여줍니다. 기본 모듈 Comprehensive Perl Archive Network (CPAN)에서 받은 모듈 모두 가능합니다. 게다가 몇천 페이지에 달하는 펄의 방대한 기본 문서도 있습니다.

source: If you prefer an online version, U<http://perldoc.perl.org/> hosts recent versions of the Perl documentation.
ko: 온라인으로 보는 것을 선호한다면, 최신 버전의 펄 문서가 제공되는 U<http://perldoc.perl.org/>가 있습니다.

source: U<http://search.cpan.org/> displays the documentation of every module on the CPAN.
ko: U<http://search.cpan.org/> 는 CPAN에 있는 모든 모듈의 문서를 보여줍니다.

source: Windows users, both ActivePerl and Strawberry Perl provide a link in your Start menu to the documentation.
ko: 윈도 사용자의 경우 ActivePerl이나 Straberry Perl 모두 시작 메뉴에 문서 링크가 제공됩니다.

source: The default behavior of C<perldoc> is to display the documentation for a named module or a specific section of the core documentation:
ko: C<perldoc>의 기본 기능은 이름이 있는 모듈의 문서나 기본 문서의 특정 절을 보여주는 것입니다.

source: The first example extracts documentation written for the C<List::Util> module and displays it in a form appropriate for your screen.
ko: 첫번째 예제를 수행하면 C<List::Util> 모듈을 위해 작성된 문서를 추출하여 여러분의 화면에 알맞은 양식으로 보여줍니다.

source: Community standards for CPAN modules (L<cpan>) suggest that additional libraries use the same documentation format and form as core modules, so there's no distinction between reading the documentation for a core library such as C<Data::Dumper> or one installed from the CPAN.
ko: CPAN 모듈의 커뮤니티 표준(L<cpan>)은 추가적인 라이브러리가 기본 모듈의 것과 같은 문서 양식을 사용하는 것을 제안합니다. 따라서 C<Data::Dumper>와 같은 기본 라이브러리 문서를 읽는 것은 CPAN에서 설치한 모듈의 문서와 다른 점이 없습니다.

source: The standard documentation template includes a description of the module, demonstrates sample uses, and then contains a detailed explanation of the module and its interface.
ko: 표준적인 문서 견본은 모듈의 설명과 실례 사용법을 포함하고, 그런 후에 모듈의 자세한 설명과 인터페이스를 설명합니다.

source: While the amount of documentation varies by author, the form of the documentation is remarkably consistent.
ko: 저자에 따라 문서의 양은 다양한 반면, 문서의 양식은 현저하게 일관적입니다.

source: The second example displays a pure documentation file, in this case the table of contents of the core documentation itself.
ko: 두번째 예제는 순수하게 문서 파일만을 보여줍니다. 이 경우에는 기본 문서의 목차를 보여줍니다.

source: This file describes each individual piece of the core documentation; browse it for a good understanding of Perl's breadth.
ko: 이 파일은 기본 문서의 각 일부분을 설명합니다. 필요한 부분을 펄에 대한 폭넓은 이해를 위해 열람합니다.

source: The third example resembles the second; C<Moose::Manual> is part of the Moose CPAN distribution (L<moose>).
ko: 세번째 예제는 두번째 예제와 비슷합니다. C<Moose::Manual>은 CPAN에서 배포되는 Moose(L<moose>)의 일부분입니다.

source: It is also purely documentation; it contains no code.
ko: 이것도 순수한 문서 파일로 코드를 전혀 포함하지 않습니다.

source: Similarly, C<perldoc perlfaq> will display the table of contents for Frequently Asked Questions about Perl 5.
ko: 같은 양상으로, C<perldoc perlfaq>는 펄 5의 자주 하는 질문(FAQ)의 목차를 보여줍니다.

source: Skimming these questions is invaluable.
ko: 여기있는 질문들을 훑어보는 것은 매우 유용합니다.

source: X<perldoc; C<-q> (search perlfaq)>
ko: X<perldoc; C<-q> (perlfaq 검색하기)>

source: The C<perldoc> utility has many more abilities (see C<perldoc perldoc>).
ko: C<perldoc> 도구에는 그외 더 많은 기능이 있습니다. (C<perldoc perldoc>를 해보세요).

source: Two of the most useful are the C<-q> and the C<-f> flags.
ko: 가장 유용한 것 중 두 개는 C<-q>와 C<-f> 플래그입니다.

source: The C<-q> flag takes a keyword or keywords and searches only the Perl FAQ, displaying all results.
ko: C<-q> 플래그는 하나 또는 그 이상의 키워드를 받아 펄 FAQ를 검색하고 모든 결과를 표시합니다.

source: Thus C<perldoc -q sort> returns three questions: I<How do I sort an array by (anything)?>, I<How do I sort a hash (optionally by value instead of key)?>, and I<How can I always keep my hash sorted?>.
ko: 따라서 C<perldoc -q sort>는 세 개의 질문을 반환합니다: I<(어떤 방법)으로 배열을 정렬하는 방법은 무엇인가요?>, I<어떻게 해시를 정렬하나요? (추가적으로 키 대신 값으로)>, and I<어떻게 해시가 항상 정렬을 유지하도록 하나요?>.

source: X<perldoc; C<-f> (search perlfunc)>
ko: X<perldoc; C<-f> (perlfunc 검색하기)>

source: The C<-f> flag displays the core documentation for a builtin Perl function.
ko: C<-f> 플래그는 펄의 기본 함수에 대한 기본 문서를 출력합니다.

source: C<perldoc -f sort> explains the behavior of the C<sort> operator.
ko: C<perldoc -f sort> 는 C<sort> 연산자의 행동을 설명합니다.

source: If you don't know the name of the function you want, use C<perldoc perlfunc> to see a list of functions.
ko: 만약 여러분이 원하는 함수의 이름을 모른다면, C<perldoc perlfunc>를 사용하여 함수의 목록을 참고합니다.

source: C<perldoc perlop> and C<perldoc perlsyn> document Perl's symbolic operators and syntactic constructs; C<perldoc perldiag> explains the meanings of Perl's warning messages.
ko: C<perldoc perlop>과 C<perldoc perlsyn>는 펄의 기호 연산자와 문법 구성이 기록되어 있습니다. C<perldoc perldiag>는 펄의 경고 메시지의 의미를 설명합니다.

source: Perl 5's documentation system is I<POD>, or I<Plain Old Documentation>.
ko: 펄 5의 문서 체계를 I<POD> 또는 I<Plain Old Documentation>라고 합니다.

source: C<perldoc perlpod> describes how POD works.
ko: C<perldoc perlpod>는 POD가 작동하는 방식을 설명합니다.

source: The C<perldoc> utility will display the POD in any Perl module you create and install for your project, and other POD tools such as C<podchecker>, which validates the form of your POD, and C<Pod::Webserver>, which displays local POD as HTML through a minimal web server, will handle valid POD correctly.
ko: C<perldoc> 도구는 여러분의 프로젝트에서 제작했거나 설치한 모든 펄 모듈에 포함된 POD를 보여줄 수 있습니다. C<podchecker>는 여러분의 POD 양식이 옳바른지 검사합니다. C<Pod::Webserver>는 로컬의 POD를 작은 웹 서버를 통해 HTML로 보여줍니다.

source: X<perldoc; C<-l> (list path to POD)> X<perldoc; C<-m> (show raw POD)>
ko: X<perldoc; C<-l> (POD 경로 나열하기)> X<perldoc; C<-m> (POD 파일 그대로 보여주기)>

source: C<perldoc> has other uses.
ko: C<perldoc>은 다른 용도로도 사용할 수 있습니다.

source: With the C<-l> command-line flag, it displays the I<path> to the documentation file rather than the contents of the documentationN<Be aware that a module may have a separate F<.pod> file in addition to its F<.pm> file.>.
ko: C<-l> 명령행 플래그를 사용하면 문서N<모듈이 F<.pm>파일과 추가적으로 F<.pod>파일까지 포함할 수도 있다는 점을 주의하세요.>의 내용물 대신 문서 파일의 I<path>를 보여줍니다.

source: With the C<-m> flag, it displays the entire I<contents> of the module, code and all, without processing any POD instructions.
ko: C<-m> 플래그를 사용하면 POD 명령어들을 처리하지 않고 모듈의 모든 I<contents>와, 코드 등을 모두 있는 그대로 보여줍니다.

source: =head0 The Perl Philosophy
ko: =head0 펄의 철학

source: Perl is a language for getting things done.
ko: 펄은 일을 쉽게 끝내기 위한 언어입니다.

source: It's flexible, forgiving, and malleable.
ko: 유연하고 너그러우며 펄 자체를 바꿀 수도 있습니다.

source: In the hands of a capable programmer, it can accomplish almost any task, from one-liner calculations and automations to multi-programmer, multi-year projects and everything in between.
ko: 유능한 프로그래머의 수중에 맡겨지면 원라이너 형태의 계산식이나 자동화 작업부터 많은 인원이 드는 몇년짜리 프로젝트까지 거의 모든 작업을 해낼 수 있습니다.

source: Perl is powerful, and modern Perl--Perl which takes advantage of the best knowledge, deepest experience, and reusable idioms of the global Perl community--is maintainable, fast, and easy to use.
ko: 펄은 강력합니다. 그리고 전세계 펄 커뮤니티의 깊은 경험과 지식, 그리고 유용한 표현들을 모은 현대의 펄은 유지보수적이며, 빠르고 쉽습니다.

source: Perhaps most importantly, it can help you do what you need to do with little frustration and no ceremony.
ko: 아마도 여기서 가장 중요한 점은, 형식에 치우치지 않고도 혼란을 최소화하며 여러분이 원하는 것을 해낼 수 있도록 돕는다는 점입니다.

source: Perl is a pragmatic language.
ko: 펄은 실용적인 언어입니다.

source: You, the programmer, are in charge.
ko: 프로그래머인 여러분에게 책임이 있습니다.

source: Rather than manipulating your mind and your problems to fit how the language designer thinks you should write programs, Perl allows you to solve your problems as you see fit.
ko: 여러분의 마음이나 여러분이 해결해야 할 문제를 언어 설계자의 의도에 맞도록 바꾸어야 하는 대신, 펄은 여러분이 보기에 맞는 방법으로 문제를 해결할 수 있도록 합니다.

source: Perl is a language which can grow with you.
ko: 펄은 여러분과 함께 성장할 수 있는 언어입니다.

source: You can write useful programs with the knowledge that you can learn in an hour of reading this book.
ko: 여러분은 이 책을 통해 한시간 동안 배운 지식을 활용하여 유용한 프로그램을 작성할 수 있습니다.

source: Yet if you take the time to understand the philosophies behind the syntax, semantics, and design of the language, you can be far more productive.
ko: 단, 여러분이 신택스와 시맨틱에 녹아있는 철학과 언어의 설계를 이해하는 데 시간을 투자하면 여러분은 더욱 생산적일 수 있습니다.

source: First, you need to know how to learn more.
ko: 먼저, 이 책 이외에서 더 배우는 방법을 알아봅시다.

source: =head0 Managing Real Programs
ko: =head0 실제 프로그램을 다루자
